/* @generated */
// prettier-ignore
if (Intl.DisplayNames && typeof Intl.DisplayNames.__addLocaleData === 'function') {
  Intl.DisplayNames.__addLocaleData({
  "data": {
    "patterns": {
      "locale": "{0} ({1})"
    },
    "types": {
      "calendar": {
        "long": {
          "gregorian": "ग्रेगोरियन पञ्चाङ्ग"
        },
        "narrow": {
        },
        "short": {
        }
      },
      "currency": {
        "long": {
          "AFN": "",
          "AMD": "",
          "AOA": "",
          "ARS": "",
          "AUD": "",
          "AZN": "",
          "BAM": "",
          "BBD": "",
          "BDT": "",
          "BMD": "",
          "BND": "",
          "BOB": "",
          "BRL": "ब्राजीली रियाल",
          "BSD": "",
          "BWP": "",
          "BZD": "",
          "CAD": "",
          "CLP": "",
          "CNY": "चीनी युआन",
          "COP": "",
          "CRC": "",
          "CUC": "",
          "CUP": "",
          "CZK": "",
          "DKK": "",
          "DOP": "",
          "EGP": "",
          "ESP": "",
          "EUR": "फिरङ्गिन् मुद्रा",
          "FJD": "",
          "FKP": "",
          "GBP": "आङ्ग्लदेशीयः पाउंड",
          "GEL": "",
          "GHS": "",
          "GIP": "",
          "GNF": "",
          "GTQ": "",
          "GYD": "",
          "HKD": "",
          "HNL": "",
          "HRK": "",
          "HUF": "",
          "IDR": "",
          "ILS": "",
          "INR": "भारतीय रूप्यकम्",
          "ISK": "",
          "JMD": "",
          "JPY": "जापानी येन",
          "KHR": "",
          "KMF": "",
          "KPW": "",
          "KRW": "",
          "KYD": "",
          "KZT": "",
          "LAK": "",
          "LBP": "",
          "LKR": "",
          "LRD": "",
          "LTL": "",
          "LVL": "",
          "MGA": "",
          "MMK": "",
          "MNT": "",
          "MUR": "",
          "MXN": "",
          "MYR": "",
          "NAD": "",
          "NGN": "",
          "NIO": "",
          "NOK": "",
          "NPR": "",
          "NZD": "",
          "PHP": "",
          "PKR": "",
          "PLN": "",
          "PYG": "",
          "RON": "",
          "RUB": "रष्यदेशीय रूबल",
          "RWF": "",
          "SBD": "",
          "SEK": "",
          "SGD": "",
          "SHP": "",
          "SRD": "",
          "SSP": "",
          "STN": "",
          "SYP": "",
          "THB": "",
          "TOP": "",
          "TRY": "",
          "TTD": "",
          "TWD": "",
          "UAH": "",
          "USD": "यूएस डॉलर",
          "UYU": "",
          "VEF": "",
          "VND": "",
          "XAF": "",
          "XCD": "",
          "XOF": "",
          "XPF": "",
          "XXX": "अज्ञात मुद्रा",
          "ZAR": "",
          "ZMW": ""
        },
        "narrow": {
        },
        "short": {
        }
      },
      "dateTimeField": {
        "long": {
          "day": "वासर:",
          "dayOfYear": "Day Of Year",
          "dayperiod": "पूर्वाह्न/अपराह्न",
          "era": "युग",
          "hour": "होरा",
          "minute": "निमेष",
          "month": "मास:",
          "quarter": "त्रेमासिक",
          "second": "क्षण",
          "timeZoneName": "समय मण्डल",
          "weekOfMonth": "Week Of Month",
          "weekOfYear": "सप्ताह:",
          "weekday": "सप्ताहस्य दिनं",
          "weekdayOfMonth": "Weekday Of Month",
          "year": "वर्ष:"
        },
        "narrow": {
          "day": "दिनम्",
          "dayOfYear": "Day Of Year",
          "dayperiod": "पूर्वाह्न/अपराह्न",
          "era": "युग",
          "hour": "होरा",
          "minute": "निमेष",
          "month": "मास",
          "quarter": "त्रेमासिक",
          "second": "पल",
          "timeZoneName": "समय मण्डल",
          "weekOfMonth": "Week Of Month",
          "weekOfYear": "सप्ताह",
          "weekday": "सप्ताहस्य दिनं",
          "weekdayOfMonth": "Weekday Of Month",
          "year": "वर्ष"
        },
        "short": {
          "day": "वासर:",
          "dayOfYear": "Day Of Year",
          "dayperiod": "पूर्वाह्न/अपराह्न",
          "era": "युग",
          "hour": "होरा",
          "minute": "निमेष",
          "month": "मास",
          "quarter": "त्रेमासिक",
          "second": "पल",
          "timeZoneName": "समय मण्डल",
          "weekOfMonth": "Week Of Month",
          "weekOfYear": "सप्ताह",
          "weekday": "सप्ताहस्य दिनं",
          "weekdayOfMonth": "Weekday Of Month",
          "year": "वर्ष:"
        }
      },
      "language": {
        "dialect": {
          "long": {
            "ace": "अचिनीस्",
            "ach": "अचोलि",
            "anp": "अङ्गिक",
            "de": "जर्मनभाषा:",
            "de-AT": "ऑस्ट्रियाई जर्मनभाषा:",
            "de-CH": "स्विस उच्च जर्मनभाषा:",
            "en": "आङ्ग्लभाषा",
            "en-AU": "ऑस्ट्रेलियादेशः आङ्ग्लभाषा",
            "en-CA": "कनाडादेशः आङ्ग्लभाषा",
            "en-GB": "आङ्ग्लदेशीय आङ्ग्लभाषा:",
            "en-US": "अमेरिकादेशीय आङ्ग्लभाषा:",
            "es": "स्पेनीय भाषा:",
            "es-419": "लैटिन अमेरिकादेशीय स्पेनीय भाषा:",
            "es-ES": "फिरङ्गिन् स्पेनीय भाषा:",
            "es-MX": "मैक्सिकन स्पेनीय भाषा:",
            "fr": "फ़्रांसदेशीय भाषा:",
            "fr-CA": "कनाडादेशः फ़्रांसदेशीय भाषा:",
            "fr-CH": "स्विस फ़्रांसदेशीय भाषा:",
            "it": "इटलीदेशीय भाषा:",
            "ja": "सूर्यमूलीय भाषा:",
            "pt": "पुर्तगालदेशीय भाषा:",
            "pt-BR": "ब्राज़ीली पुर्तगालदेशीय भाषा:",
            "pt-PT": "फिरङ्गिन् पुर्तगालदेशीय भाषा:",
            "ru": "रष्यदेशीय भाषा:",
            "sa": "संस्कृत भाषा",
            "und": "अज्ञात भाषा:",
            "zh": "चीनी",
            "zh-Hans": "सरलीकृत चीनी",
            "zh-Hant": "परम्परागत चीनी"
          },
          "narrow": {
          },
          "short": {
            "en-GB": "यूके आङ्ग्लभाषा:",
            "en-US": "यूएस आङ्ग्लभाषा:"
          }
        },
        "standard": {
          "long": {
            "ace": "अचिनीस्",
            "ach": "अचोलि",
            "anp": "अङ्गिक",
            "de": "जर्मनभाषा:",
            "de-AT": "जर्मनभाषा: (AT)",
            "de-CH": "जर्मनभाषा: (CH)",
            "en": "आङ्ग्लभाषा",
            "en-AU": "आङ्ग्लभाषा (AU)",
            "en-CA": "आङ्ग्लभाषा (CA)",
            "en-GB": "आङ्ग्लभाषा (संयुक्त राष्ट्र:)",
            "en-US": "आङ्ग्लभाषा (संयुक्त राज्य:)",
            "es": "स्पेनीय भाषा:",
            "es-419": "स्पेनीय भाषा: (419)",
            "es-ES": "स्पेनीय भाषा: (ES)",
            "es-MX": "स्पेनीय भाषा: (MX)",
            "fr": "फ़्रांसदेशीय भाषा:",
            "fr-CA": "फ़्रांसदेशीय भाषा: (CA)",
            "fr-CH": "फ़्रांसदेशीय भाषा: (CH)",
            "it": "इटलीदेशीय भाषा:",
            "ja": "सूर्यमूलीय भाषा:",
            "pt": "पुर्तगालदेशीय भाषा:",
            "pt-BR": "पुर्तगालदेशीय भाषा: (ब्राजील)",
            "pt-PT": "पुर्तगालदेशीय भाषा: (PT)",
            "ru": "रष्यदेशीय भाषा:",
            "sa": "संस्कृत भाषा",
            "und": "अज्ञात भाषा:",
            "zh": "चीनी",
            "zh-Hans": "सरलीकृत चीनी",
            "zh-Hant": "परम्परागत चीनी"
          },
          "narrow": {
          },
          "short": {
            "en-GB": "आङ्ग्लभाषा (संयुक्त राष्ट्र:)",
            "en-US": "आङ्ग्लभाषा (संयुक्त राज्य:)"
          }
        }
      },
      "region": {
        "long": {
          "BR": "ब्राजील",
          "CN": "चीन:",
          "DE": "जर्मनीदेश:",
          "FR": "फ़्रांस:",
          "GB": "संयुक्त राष्ट्र:",
          "IN": "भारतः",
          "IT": "इटली:",
          "JP": "जापन:",
          "RU": "रष्यदेश:",
          "US": "संयुक्त राज्य:",
          "ZZ": "अज्ञात क्षेत्र:"
        },
        "narrow": {
        },
        "short": {
          "GB": "संयुक्त राष्ट्र:",
          "US": "संयुक्त राज्य:"
        }
      },
      "script": {
        "long": {
          "Arab": "अरबी",
          "Cyrl": "सिरिलिक:",
          "Hans": "सरलीकृत",
          "Hant": "परम्परागत",
          "Latn": "लैटिन:",
          "Zxxx": "अलिखित:",
          "Zzzz": "अज्ञात लिपि:"
        },
        "narrow": {
        },
        "short": {
        }
      }
    }
  },
  "locale": "sa"
})
}